// import {generateUUID} from "../utils/utils.ts";
import type {TExpert} from "../types/expert.ts";

export const experts: TExpert[] = [
    {
        id: "34543623632fdgasdfgs",
        name: "Ланцов Роман",
        description: `Основатель Bee Barista, национальный эксперт и разработчик стандартов чемпионата. 10 лет в кофейной индустрии.`,
        photo: "/images/Ланцов.jpg",
        position: "Основатель компетенции и проекта Bee Barista",
        expertise: [
            `Национальный эксперт компетенции "Мастерство приготовления кофе и чая"`,
            "Разработчик конкурсной документации национального чемпионата",
            "Судья национальных и международных чемпионатов",
            "Специалист в кофейной и чайной индустрии, а также контролю качества",
            "Автор образовательных программ по бариста-мастерству",
            "Консультант по открытию и развитию кофеен и чайных"
        ],
        achievements: "Подготовил более 10 призеров чемпионатов по бариста-мастерству. Разработал систему оценки компетенции, принятую в качестве стандарта в российской кофейной и чайной индустриях. Основал проект Bee Barista, которая стала образовательной платформой для бариста.",
        contactInfo: "Для консультаций и мастер-классов доступен через форму заявки",
        socialLinks: {
            telegram: "https://t.me/roman_lantsov",
        },
        previewPhoto: '',
        status: 'Основатель компетенции и проекта Bee Barista',
    },
    {
        id: "345436gnfdgndf632fdgasdfgs",
        name: "Хромова Ирина",
        description: `Главный эксперт компетенции по г. Москве, руководитель группы оценки межрегионального чемпионата.`,
        position: "Действующий эксперт и преподаватель курсов проекта Bee Barista",
        expertise: [
            `Руководитель группы оценки национального чемпионата "Мастерство приготовления кофе и чая"`,
            "Судья национальных и международных чемпионатов",
            "Дипломированный специалист по пищевой безопасности и контролю качества",
            "Соавтор образовательных программ",
            "Консультант по открытию и развитию Предприятий общественного питания"
        ],
        achievements: `Руководит группой оценки и формирует калибровку оценочной группы на каждом межрегиональном чемпионате по компетенции "Мастерство приготовления кофе и чая".`,
        contactInfo: "Для консультаций и мастер-классов доступен через форму заявки",
        socialLinks: {
            telegram: "https://t.me/roman_lantsov",
        },
        photo: "/images/Хромова.jpg",
        previewPhoto: '',
        status: 'Главный эксперт по г. Москве',
    },{
        id: "3454362hjhg8fbd789sdfgs",
        name: "Бродская Ольга",
        description: `Главный эксперт юниорского направления, преподаватель курса «Бариста с 0», судья чемпионатов.`,
        position: "Действующий эксперт и преподаватель курсов проекта Bee Barista",
        expertise: [
            `Эксперт компетенции "Мастерство приготовления кофе и чая"`,
            "Судья национальных и международных чемпионатов",
            "Соавтор образовательных программ по бариста-мастерству",
            "Консультант по открытию и развитию кофеен"
        ],
        achievements: "Соавтор образовательных программ юниорской ветки в кофейной и чайной индустриях. Разработала систему оценки компетенций для возрастной категории 14-16 лет.",
        contactInfo: "Для консультаций и мастер-классов доступен через форму заявки",
        socialLinks: {
            telegram: "https://t.me/roman_lantsov",
        },
        photo: "/images/Бродская.jpg",
        previewPhoto: '',
        status: 'Главный эксперт по г. Москве по юниорам',
    },{
        id: "3454hvgjgfdbcrcbsdfgs",
        name: "Кудрявцев Артем",
        description: `Главный эксперт межрегионального этапа, обжарщик кофе, преподаватель курсов по обжарке и каппингу.`,
        position: "Действующий эксперт и преподаватель курсов проекта Bee Barista",
        expertise: [
            `Эксперт компетенции "Мастерство приготовления кофе и чая"`,
            "Судья национальных и международных чемпионатов",
            "Специалист по обжарке кофе и контролю качества",
            "Соавтор образовательных программ по бариста-мастерству",
        ],
        achievements: "Разработал уникальную методику обучения по обжарке кофейных зерен. Соавтор образовательных программ проекта Bee Barista.",
        contactInfo: "Для консультаций и мастер-классов доступен через форму заявки",
        socialLinks: {
            telegram: "https://t.me/roman_lantsov",
        },
        photo: "/images/Кудрявцев.jpg",
        previewPhoto: '',
        status: 'Главный эксперт межрегионального этапа чемпионата',
    },
]
